#include "iic.h"
#include "delay.h" // 必须包含延时函数

/****************************************************************************
*函数名：iicbus_init
*输  入：无
*输  出：无
*功  能：初始化IIC
****************************************************************************/ 
void iicbus_init(void)
{
    // 【修改说明】因为CubeMX已经配置了 PB8/PB9，这里不需要再配置 GPIO
    // 直接拉高总线，释放总线即可
    iicbus_stop();     
}

/****************************************************************************
*函数名：iic_delay
*输  入：无
*输  出：无
*功  能：IIC延时函数,用于控制IIC读写速度
****************************************************************************/ 
static void iic_delay(void)
{
    delay_us(2);    /* 2us的延时, 读写速度在250Khz以内 大约130Khz*/
}

/****************************************************************************
*函数名：iicbus_start
*输  入：无
*输  出：无
*功  能：产生IIC起始信号
****************************************************************************/ 
void iicbus_start(void)
{
    IIC_SCL_H();    
    IIC_SDA_H();
    iic_delay();
    
    IIC_SDA_L();
    iic_delay();
    
    IIC_SCL_L();
    iic_delay();
}

/****************************************************************************
*函数名：iicbus_stop
*输  入：无
*输  出：无
*功  能：产生IIC停止信号
****************************************************************************/ 
void iicbus_stop(void)
{
    IIC_SDA_L();
    iic_delay();
    
    IIC_SCL_H();
    iic_delay();
    
    IIC_SDA_H();
    iic_delay();
}

/****************************************************************************
*函数名：iicbus_wait_ack
*输  入：无
*输  出：1：接收应答失败  0：接收应答成功
*功  能：等待应答信号
****************************************************************************/
uint8_t iicbus_wait_ack(void)
{
    uint8_t waittime = 0;
    uint8_t rack = 0;
    
    IIC_SCL_L();
    iic_delay();
    
    IIC_SCL_H();
    iic_delay();
    
    IIC_SDA_H();     /* 主机释放SDA线(此时外部器件可以拉低SDA线) */
    iic_delay();
    
    while (IIC_SDA_R)    /* 等待应答 */
    {
        waittime++;

        if (waittime > 250)
        {
            iicbus_stop();
            rack = 1;
            break;
        }
    }
    
    IIC_SCL_L();     /* SCL=0, 结束ACK检查 */
    iic_delay();
    
    return rack;
}

/****************************************************************************
*函数名：iicbus_ack
*输  入：无
*输  出：无
*功  能：产生ACK应答      SDA = 0
****************************************************************************/
void iicbus_ack(void)
{
    IIC_SDA_L();
    iic_delay();
    
    IIC_SCL_H();
    iic_delay();
    
    IIC_SCL_L();
    iic_delay();
    
    IIC_SDA_H();     /* 主机释放SDA线 */
    iic_delay();
}

/****************************************************************************
*函数名：iicbus_nack
*输  入：无
*输  出：无
*功  能：不产生ACK应答     SDA = 1
****************************************************************************/
void iicbus_nack(void)
{
    IIC_SDA_H();
    iic_delay();

    IIC_SCL_H();
    iic_delay();

    IIC_SCL_L();
    iic_delay();
}

/****************************************************************************
*函数名：iicbus_send_byte
*输  入：data: 要发送的数据
*输  出：无
*功  能：IIC发送一个字节
****************************************************************************/
void iicbus_send_byte(uint8_t data)
{
    for (int i = 0; i < 8; i++){
        if((data & 0x80 ) >> 7) {
            IIC_SDA_H();
        } else {
            IIC_SDA_L();
        }
        iic_delay();
        IIC_SCL_H();
        iic_delay();
        IIC_SCL_L();
        data <<= 1;
    }
    
    IIC_SDA_H();
}

/****************************************************************************
*函数名：iicbus_read_byte
*输  入：ack:  ack=1时，发送ack; ack=0时，发送nack
*输  出：读取到的数据
*功  能：IIC读取一个字节
****************************************************************************/
uint8_t iicbus_read_byte(uint8_t ack)
{
    uint8_t rec = 0;
    
    for (int i = 0;i < 8; i++) {
        IIC_SCL_H();
        iic_delay();
        rec <<= 1;  /* 高位先输出,所以先收到的数据位要左移 */
        
        if (IIC_SDA_R) {
            rec++;
        }

        IIC_SCL_L();
        iic_delay();
    }
    
    if (ack) {
        iicbus_ack();       /* 发送ACK */
    }
    else {
        iicbus_nack();      /* 发送NACK */
    }

    return rec;
}